{
    "career": {
      "Marine Corps": {
        "weight": 4,
        "subclasses": {
          "Star Trooper": {
            "description": "Specialized in space-based combat, these marines are trained for combat both in space and on planetary surfaces."
          },
          "Colonial Guard": {
            "description": "You are part of the defensive forces stationed at colonies, protecting them from external threats."
          },
          "Engineer Forces": {
            "description": "Combat engineers who are responsible for building and maintaining structures during combat operations."
          },
          "Fleet Marine": {
            "description": "Tasked with protecting fleet ships and engaging in boarding actions during space combat."
          },
          "Tactical Sniper": {
            "description": "Trained in long-range combat, specializing in precision strikes from a distance."
          }
        }
      },
      "Intelligence Operative": {
        "weight": 3,
        "subclasses": {
          "Field Agent": {
            "description": "Operates in the field, gathering intelligence through covert missions and direct interaction."
          },
          "Psychological Warfare Specialist": {
            "description": "Specializes in manipulating enemy morale and using psychological tactics to weaken opponents."
          },
          "Infiltration Expert": {
            "description": "Trained in covertly penetrating enemy defenses and operating behind enemy lines."
          },
          "Signals Intelligence": {
            "description": "Specializes in intercepting and analyzing enemy communications to gather valuable intel."
          },
          "Counter-Intelligence Operative": {
            "description": "Works to neutralize enemy intelligence efforts and protect sensitive information."
          }
        }
      },
      "Corporate Agent": {
        "weight": 3,
        "subclasses": {
          "Deep Cover Agent": {
            "description": "Operates undercover within rival organizations, gathering information and sabotaging operations."
          },
          "Tech Saboteur": {
            "description": "Specializes in disabling or corrupting enemy technology, causing chaos within their systems."
          },
          "Asset Extraction Expert": {
            "description": "Responsible for locating and retrieving valuable corporate assets, whether people or technology."
          },
          "Double Agent": {
            "description": "Plays both sides of a conflict, working for multiple parties while serving their corporate masters."
          }
        }
      },
      "Engineer": {
        "weight": 4,
        "subclasses": {
          "Starship Engineer": {
            "description": "Maintains and repairs starship systems, ensuring vessels remain operational during missions."
          },
          "Colonial Infrastructure Engineer": {
            "description": "Responsible for building and maintaining the critical infrastructure of planetary colonies."
          },
          "Robotics Engineer": {
            "description": "Designs, builds, and maintains advanced robotics for use in a variety of applications."
          },
          "Weapons Specialist": {
            "description": "Focuses on the design and maintenance of advanced weapon systems."
          },
          "Terraforming Engineer": {
            "description": "Works on transforming hostile environments into habitable ones, adapting planets to human life."
          }
        }
      },
      "Scientist": {
        "weight": 3,
        "subclasses": {
          "Xeno-Studies Expert": {
            "description": "Specializes in studying alien life forms and their potential for human use or exploitation."
          },
          "Medical Scientist": {
            "description": "Researches medical advancements and explores cutting-edge science to treat diseases and injuries."
          },
          "Terraforming Biologist": {
            "description": "Studies how to adapt flora and fauna to new planetary environments, contributing to terraforming efforts."
          },
          "Astrophysicist": {
            "description": "Studies the stars, planets, and the physical universe, conducting research on celestial bodies."
          },
          "Cryostasis Specialist": {
            "description": "Focuses on stasis technology and its applications, including long-term space travel and medical preservation."
          }
        }
      },
      "Pilot": {
        "weight": 4,
        "subclasses": {
          "Commercial Transport Pilot": {
            "description": "Trained to fly commercial vessels, transporting goods and passengers across space."
          },
          "Military Fighter Pilot": {
            "description": "Specialized in high-speed combat vessels used in space and planetary defense missions."
          },
          "Exploration Pilot": {
            "description": "Leads exploratory missions to uncharted regions of space, navigating through the unknown."
          },
          "Freighter Captain": {
            "description": "Commanding large freighters and responsible for the transport of heavy cargo across vast distances."
          },
          "Smuggler Pilot": {
            "description": "Specialized in avoiding law enforcement while transporting contraband through dangerous space lanes."
          }
        }
      },
      "Criminal Networks": {
        "subclasses": {
          "Smuggler Apprentice": {
            "description": "You learned the ropes of smuggling contraband across borders and avoiding detection."
          },
          "Info Broker": {
            "description": "You specialized in gathering and selling valuable information in the criminal underground."
          },
          "Counterfeiter": {
            "description": "You were trained to forge documents, credits, and other valuable materials."
          },
          "Gang Enforcer": {
            "description": "You acted as muscle for a criminal organization, enforcing their will through violence and intimidation."
          },
          "Assassin": {
            "description": "You were trained to eliminate targets for profit with stealth and precision."
          }
        }
      }
    }
  }
  