{
    "higher_education": {
      "Military Academy": {
        "subclasses": {
          "Fleet Command": {
            "description": "You were trained to lead naval and space fleets in large-scale operations and strategic planning."
          },
          "Tactical Operations": {
            "description": "You specialized in ground and space-based tactical maneuvers and combat scenarios."
          },
          "Logistics and Strategy": {
            "description": "You focused on military logistics, resource management, and long-term strategic planning."
          },
          "Special Forces Training": {
            "description": "You underwent intense physical and mental training for high-risk special operations."
          },
          "Covert Operations": {
            "description": "You were trained for secretive missions involving intelligence gathering and sabotage."
          }
        }
      },
      "Corporate Indoctrination": {
        "subclasses": {
          "Corporate Aristocrat": {
            "description": "You were groomed for leadership within the corporate elite, learning about economics and influence."
          },
          "Market Strategist": {
            "description": "You specialized in corporate market manipulation, finance, and competitive strategy."
          },
          "Internal Security": {
            "description": "You were trained to protect the corporation from internal and external threats."
          },
          "Corporate Lawyer": {
            "description": "You studied corporate law to defend your employer’s interests and navigate legal challenges."
          },
          "PR Specialist": {
            "description": "You learned how to shape public perception and manage corporate communications."
          }
        }
      },
      "Technical School": {
        "subclasses": {
          "Starship Engineering": {
            "description": "You were trained in the mechanics and systems required to maintain and repair starships."
          },
          "Robotics Specialist": {
            "description": "You focused on designing and maintaining advanced robotics systems."
          },
          "Advanced AI Systems": {
            "description": "You specialized in creating and optimizing artificial intelligence technologies."
          },
          "Weapon Systems Engineer": {
            "description": "You were trained to build and maintain advanced weaponry and defense systems."
          },
          "Infrastructure Specialist": {
            "description": "You learned to design, build, and maintain colony and space station infrastructure."
          }
        }
      },
      "Space Academy": {
        "subclasses": {
          "Astrogator": {
            "description": "You specialized in stellar navigation and charting courses through uncharted space."
          },
          "Flight Cadet": {
            "description": "You trained in basic piloting and flight operations."
          },
          "Combat Pilot": {
            "description": "You were trained to fly and fight in combat vessels."
          },
          "Space Exploration": {
            "description": "You specialized in long-term space missions, exploration, and survival in unknown regions."
          },
          "Spaceborne Engineer": {
            "description": "You were trained to repair and maintain spacecraft systems during space missions."
          }
        }
      },
      "University": {
        "subclasses": {
          "Trauma Surgeon": {
            "description": "You were trained to operate in high-pressure medical emergencies, especially on the battlefield."
          },
          "Xeno-Biologist": {
            "description": "You studied alien biology and how to treat or exploit alien species for human benefit."
          },
          "Stasis Tech": {
            "description": "You learned to manage stasis technologies and deal with stasis-related medical issues."
          },
          "Biotech Specialist": {
            "description": "You specialized in biological engineering, using biotech to enhance human capabilities."
          },
          "Quarantine Specialist": {
            "description": "You trained in managing biohazard outbreaks and preventing the spread of dangerous organisms."
          }
        }
      }
    }
  }
  