{
    "early": [
      {
        "description": "Born into a family of corporate executives, you were groomed from a young age to understand the intricacies of corporate governance.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "At age seven, you were enrolled in an elite academy focused on leadership and corporate strategy.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You excelled in studies of economics and resource management, showing a keen aptitude for complex systems.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "Witnessing a hostile takeover of a subsidiary, you learned the harsh realities of corporate politics.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "A mentor introduced you to the art of negotiation, enhancing your persuasive abilities.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You were taught to view employees as assets, shaping your perspective on human resources.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "An early assignment required you to manage a small team, revealing your leadership potential.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You discovered a discrepancy in financial reports, earning commendation for your attention to detail.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "A family scandal threatened your reputation, teaching you the importance of image management.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You participated in a debate competition, honing your rhetorical skills.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "An incident of corporate espionage at your academy made you more vigilant and cautious.",
        "attributes": { "WIS": 2, "INT": 1 }
      },
      {
        "description": "You formed a rivalry with another trainee, pushing you both to excel but also creating tension.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "A mentor's unexpected departure left you questioning the stability of corporate loyalty.",
        "attributes": { "WIS": 2, "INT": 1 }
      },
      {
        "description": "You developed a keen interest in colonial management, focusing on resource extraction and efficiency.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "An ethics course challenged your views on corporate practices, creating internal conflict.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You learned to play a strategic board game, enhancing your tactical thinking.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "A minor health issue required you to adapt your routine, teaching resilience.",
        "attributes": { "INT": 2, "WIS": 1 }
      }
    ],
    "mid": [
      {
        "description": "You were assigned to a remote colony as an assistant overseer, gaining hands-on experience.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "A labor dispute forced you to mediate between workers and management, testing your diplomacy skills.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You uncovered a smuggling operation within the colony, leading to increased security measures.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "An accident at the colony exposed you to the dangers of neglecting safety protocols.",
        "attributes": { "WIS": 1 }
      },
      {
        "description": "You implemented a new resource allocation system, improving efficiency but causing unrest among workers.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "A rival attempted to undermine your authority, forcing you to navigate corporate politics deftly.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You began to question the corporation's practices after witnessing exploitation firsthand.",
        "attributes": { "WIS": 1 }
      },
      {
        "description": "An opportunity to embezzle funds presented itself; your choice would affect your integrity.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You negotiated a deal with a local faction, securing valuable resources for the corporation.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "A personal relationship complicated your professional responsibilities, testing your priorities.",
        "attributes": { "WIS": 1 }
      },
      {
        "description": "You were tasked with suppressing a worker uprising, challenging your ethics and leadership.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "An illness swept through the colony; your management of the crisis was closely scrutinized.",
        "attributes": { "WIS": 1 }
      },
      {
        "description": "You discovered corruption among your superiors, forcing you to choose between reporting it or staying silent.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "A natural disaster threatened the colony; your quick thinking minimized losses.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You mentored a promising subordinate, investing in the future leadership of the colony.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "A security breach led to a loss of critical data; you coordinated the recovery efforts.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You began to implement reforms to improve worker conditions, facing resistance from higher-ups.",
        "attributes": { "WIS": 1 }
      }
    ],
    "late": [
      {
        "description": "Promoted to overseer, you now manage an entire colony, bearing the weight of its successes and failures.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "A major crisis tested your leadership; your decisions would have lasting impacts.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You discovered a plot against the corporation originating from within your colony.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "A personal loss affected your ability to lead, forcing you to confront your vulnerabilities.",
        "attributes": { "WIS": 2, "INT": 1 }
      },
      {
        "description": "You were offered a lucrative position that conflicted with your personal ethics.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "An internal audit put your management practices under scrutiny, revealing both strengths and weaknesses.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You initiated a major project that could revolutionize the colony's productivity.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "A rebellion threatened the stability of your colony; your response would define your legacy.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You faced a moral dilemma when ordered to implement harsh policies against workers.",
        "attributes": { "WIS": 2, "INT": 1 }
      },
      {
        "description": "A technological innovation you supported led to unforeseen consequences.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You began to suffer from stress-related health issues, impacting your effectiveness.",
        "attributes": { "WIS": 2, "INT": 1 }
      },
      {
        "description": "An opportunity arose to expose corporate malpractice; acting on it could risk everything you've built.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You were tasked with integrating new policies that could improve or harm worker welfare.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "A former rival sought your help, forcing you to weigh past grievances against current needs.",
        "attributes": { "WIS": 2, "INT": 1 }
      },
      {
        "description": "You contemplated leaving the corporation to pursue a different path, questioning your long-held beliefs.",
        "attributes": { "WIS": 2, "INT": 1 }
      },
      {
        "description": "Your colony achieved record productivity, but at the cost of worker well-being.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "An external threat required you to collaborate with unlikely allies for the colony's survival.",
        "attributes": { "INT": 2, "AGI": 1 }
      }
    ]
  }
  