{
    "early": [
      {
        "description": "Born into a prestigious military family, you were taught strategy and tactics before you could read.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "At age six, you witnessed a military parade showcasing the might of corporate forces, fueling your ambition to lead.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You excelled in early education, particularly in war history and leadership studies.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "A family member's downfall due to a failed mission taught you the harsh realities of military life.",
        "attributes": { "INT": 2, "STR": 1 }
      },
      {
        "description": "You were enrolled in an elite military academy, where you faced intense competition and high expectations.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You developed a rivalry with another cadet, pushing you to improve but also instilling a sense of distrust.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "Witnessing a training accident that injured a friend, you became obsessed with precision and control.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "Your parents arranged for you to meet high-ranking officers, exposing you to political maneuvering within the military.",
        "attributes": { "INT": 2, "STR": 1 }
      },
      {
        "description": "You participated in simulated battles, demonstrating exceptional tactical acumen.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "An instructor recognized your potential and mentored you, deepening your understanding of military doctrine.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You uncovered a minor conspiracy among cadets to cheat on exams; choosing whether to expose them tested your ethics.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "Learning multiple languages for intelligence purposes became a focus, enhancing your cognitive abilities.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You struggled with the rigid discipline imposed by your family, fostering a rebellious streak.",
        "attributes": { "AGI": 2, "STR": 1 }
      },
      {
        "description": "A physical ailment challenged you to overcome limitations through determination and training.",
        "attributes": { "STR": 2, "AGI": 1 }
      },
      {
        "description": "You were given access to classified materials, sparking an interest in covert operations.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "Your family's legacy weighed heavily on you, causing anxiety but also driving you to excel.",
        "attributes": { "INT": 2, "STR": 1 }
      },
      {
        "description": "You developed a fascination with ancient military strategies, applying them to modern scenarios.",
        "attributes": { "INT": 2, "AGI": 1 }
      }
    ],
    "mid": [
      {
        "description": "You led a training exercise that resulted in unexpected success, earning recognition from superiors.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "A mission went awry due to faulty intelligence, teaching you the importance of verifying information.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You were assigned to a remote outpost, where you had to adapt to limited resources and isolation.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "An encounter with insurgents tested your leadership under fire, revealing strengths and weaknesses.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You uncovered corruption within your unit, forcing you to decide between loyalty and justice.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "A subordinate's mistake nearly cost lives; how you handled it affected your team's trust in you.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You successfully negotiated a ceasefire with a hostile group, demonstrating diplomatic skills.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "An injury sidelined you from active duty, leading to a period of introspection and study.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You designed a new training regimen that improved your unit's performance, showcasing innovation.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "Faced with a moral dilemma, you defied orders to protect civilians, impacting your career trajectory.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You were selected for an elite program focusing on intelligence gathering and analysis.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "A family scandal threatened your reputation; managing the fallout tested your resilience.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You mentored a promising cadet, finding fulfillment in teaching and leadership.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "An experimental technology you advocated for failed in the field, causing setbacks.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You were part of a covert operation that remains classified, burdening you with secrets.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "A rivalry with another officer escalated, challenging your professionalism and strategic thinking.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You began questioning the corporation's motives, leading to inner conflict and doubts.",
        "attributes": { "INT": 1 }
      }
    ],
    "late": [
      {
        "description": "Promoted to a high-ranking position, you now influence major strategic decisions.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You led a successful campaign that secured vital resources for the corporation.",
        "attributes": { "INT": 2, "STR": 1 }
      },
      {
        "description": "A betrayal by a trusted colleague forced you to reevaluate your alliances.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You exposed a conspiracy within the military hierarchy, risking your career to uphold integrity.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "An opportunity to join a rebel faction arose, challenging your loyalty to the corporation.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You negotiated a critical alliance with an influential faction, altering the balance of power.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "A personal loss during a conflict deeply affected you, leading to a change in your leadership style.",
        "attributes": { "INT": 2, "STR": 1 }
      },
      {
        "description": "You developed a revolutionary military tactic or technology, making you a target for rivals.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "Facing a no-win scenario, you made a controversial decision that haunts you.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "Disillusioned with corporate warfare, you considered leaving the military to pursue other goals.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You mentored the next generation of officers, leaving a lasting legacy.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "An assassination attempt revealed hidden enemies, forcing you to be constantly vigilant.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You faced a tribunal for actions taken during a mission, testing your principles and resolve.",
        "attributes": { "INT": 2, "STR": 1 }
      },
      {
        "description": "A technological breakthrough you were involved in changed the nature of warfare.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You became a key figure in corporate politics, navigating a web of intrigue and ambition.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "An opportunity to seize power presented itself; your choice would define your legacy.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You were offered a position outside the military that could change your path entirely.",
        "attributes": { "INT": 2, "AGI": 1 }
      }
    ]
  }
  