{
    "early": [
      {
        "description": "Born on a space station orbiting a mining planet, you were exposed to zero-gravity environments from an early age.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "At age ten, you disassembled and reassembled a malfunctioning maintenance bot, impressing the station's engineers.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You began an apprenticeship under a seasoned orbital mechanic, learning the basics of space machinery.",
        "attributes": { "INT": 2, "STR": 1 }
      },
      {
        "description": "A close call during an external hull repair taught you the importance of safety protocols.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You developed a fascination with the complex systems that keep space stations operational.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "Witnessing a catastrophic equipment failure instilled in you a meticulous attention to detail.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You modified your personal tools for better efficiency, showcasing your innovative spirit.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "An encounter with a veteran astronaut inspired you to aim higher in your career aspirations.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You repaired a critical life-support system under pressure, earning commendation from station leadership.",
        "attributes": { "INT": 2, "STR": 1 }
      },
      {
        "description": "A malfunction in your EVA suit during a spacewalk left you stranded temporarily, instilling a deep-seated fear of isolation.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You began studying advanced engineering texts, further enhancing your technical knowledge.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "An accident caused by a colleague's negligence taught you the importance of teamwork and communication.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You discovered a flaw in the station's structural design, preventing a potential disaster.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "A mysterious signal intercepted during maintenance piqued your curiosity about what lies beyond.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You customized a drone to assist in repairs, increasing efficiency and safety.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "An illness due to radiation exposure made you more cautious about the hazards of space.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You formed a bond with a fellow mechanic, sharing knowledge and experiences.",
        "attributes": { "INT": 2, "STR": 1 }
      }
    ],
    "mid": [
      {
        "description": "You were promoted to lead mechanic, overseeing critical repairs and maintenance tasks.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "A collision with space debris required you to perform emergency repairs under extreme conditions.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You designed a new component that improved the station's energy efficiency.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "An encounter with a rogue AI system forced you to outsmart it to regain control.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You began mentoring junior mechanics, passing on your expertise and safety protocols.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "A malfunction during a repair mission led to the loss of a colleague, causing you to question your career.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You discovered corruption in the supply chain, leading to equipment shortages and unsafe working conditions.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "An opportunity to transfer to a cutting-edge research station arose, challenging your loyalty.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You developed a rivalry with another lead mechanic, pushing both of you to excel but creating tension.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "An EVA mission exposed you to an unknown substance, leading to unexplained side effects.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You led a team to retrofit outdated systems, modernizing the station's operations.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "A critical component failure forced you to improvise a solution with limited resources.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You began experiencing recurring nightmares related to your work, affecting your performance.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "An encounter with a derelict spacecraft revealed technologies beyond your understanding.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You started questioning the corporation's practices after discovering unethical disposal of hazardous materials.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "A romantic relationship with a crew member complicated your professional responsibilities.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You suffered a physical injury that required rehabilitation, testing your resilience.",
        "attributes": { "STR": 1 }
      }
    ],
    "late": [
      {
        "description": "Promoted to chief engineer, you now oversee all mechanical operations on the station.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "A catastrophic event required you to coordinate evacuation procedures, putting lives in your hands.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You discovered a corporate cover-up regarding structural flaws in the station's design.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "A mysterious illness spread among the crew, and you suspected contamination from maintenance work.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You were offered a position on a deep-space vessel, challenging your comfort zone.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "An AI system you helped develop began exhibiting unpredictable behavior.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "Faced with budget cuts, you had to make tough decisions about resource allocation, impacting safety.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You began to suffer from a degenerative condition due to prolonged exposure to space radiation.",
        "attributes": { "INT": 2, "STR": 1 }
      },
      {
        "description": "A faction within the crew advocated for independence from corporate control, seeking your support.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You mentored a prodigy who might one day surpass you, prompting reflections on your legacy.",
        "attributes": { "INT": 2, "STR": 1 }
      },
      {
        "description": "An incident led to you being falsely accused of negligence, threatening your career.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You discovered alien technology integrated into the station's systems without crew knowledge.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "A personal tragedy on Earth affected your focus, causing you to reconsider your path.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You authored a comprehensive manual on orbital mechanics, solidifying your expertise.",
        "attributes": { "INT": 2, "STR": 1 }
      },
      {
        "description": "An opportunity to retire presented itself, but leaving space life proved more difficult than expected.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You faced a moral dilemma when ordered to prioritize corporate interests over crew safety.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "An external threat, such as pirates or a rival corporation, forced you to defend the station using your technical skills.",
        "attributes": { "INT": 2, "AGI": 1 }
      }
    ]
  }
  