{
    "early": [
      {
        "description": "Born into an expeditionary crew, your earliest memories are of alien landscapes and scientific equipment.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "At age seven, you assisted in basic data collection, showcasing your aptitude for science.",
        "attributes": { "INT": 2, "STR": 1 }
      },
      {
        "description": "You developed a keen eye for environmental details, rarely missing anomalies.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "An encounter with a hazardous environment taught you the importance of caution and protocol.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You learned to operate various instruments, demonstrating technical proficiency.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "Witnessing the wonders of new worlds instilled in you a passion for exploration.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You customized equipment for better efficiency, showing ingenuity.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "An experienced surveyor mentored you, teaching advanced techniques.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You formed a bond with another young surveyor, sharing discoveries and aspirations.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "A close call with a planetary hazard sharpened your instincts and reflexes.",
        "attributes": { "AGI": 2, "STR": 1 }
      },
      {
        "description": "You began studying scientific texts, enhancing your knowledge.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "An illness due to exposure tested your resilience and adaptability.",
        "attributes": { "STR": 2, "INT": 1 }
      },
      {
        "description": "You discovered a significant environmental anomaly, fueling your curiosity.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "A family member's reassignment prompted you to become more independent.",
        "attributes": { "INT": 2, "STR": 1 }
      },
      {
        "description": "You started experimenting with data analysis, improving your skills.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "An encounter with corporate overseers sparked your skepticism.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You developed physical strength through fieldwork in challenging conditions.",
        "attributes": { "STR": 2, "AGI": 1 }
      }
    ],
    "mid": [
      {
        "description": "You took on significant survey missions, analyzing complex environments.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "A conflict with corporate interests led to increased tension and oversight.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You discovered valuable resources, facing ethical dilemmas about exploitation.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "An offer to join a corporate team challenged your principles.",
        "attributes": { "WIS": 1 }
      },
      {
        "description": "You began mentoring younger surveyors, passing on your expertise.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "A personal injury forced you to adapt, relying more on intellect than physical ability.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "You discovered evidence of environmental damage caused by corporate activities.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "A colleague's betrayal led to increased caution and distrust.",
        "attributes": { "WIS": 1 }
      },
      {
        "description": "You faced ethical choices when asked to withhold data.",
        "attributes": { "WIS": 1 }
      },
      {
        "description": "An unexpected natural event tested your analytical skills.",
        "attributes": { "INT": 1 }
      }
    ],
    "late": [
      {
        "description": "Elevated to a leadership role, you coordinated major survey operations.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "A significant discovery threatened the balance of the ecosystem, requiring decisive action.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You uncovered a corporate plot to exploit planetary resources, prompting difficult choices.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "Faced with a moral dilemma, you had to choose between scientific integrity and corporate demands.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "An opportunity to join an independent research group challenged your priorities.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You exposed illegal activities harming the environment, preventing further damage.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "A personal tragedy prompted deep reflection on your career path.",
        "attributes": { "INT": 2, "STR": 1 }
      },
      {
        "description": "You began to suffer from the psychological effects of isolation and ethical conflicts.",
        "attributes": { "STR": 2, "INT": 1 }
      },
      {
        "description": "A movement to protect the planet gained momentum, and you had to decide your role.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You mentored a young surveyor, hoping to pass on your knowledge and values.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "Environmental conditions worsened, making surveying increasingly challenging.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You authored a groundbreaking study on planetary environments.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "An external threat, such as invasive species or natural disasters, endangered the planet.",
        "attributes": { "AGI": 2, "STR": 1 }
      },
      {
        "description": "You faced a critical decision when offered a chance to leave for a more stable assignment.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "An unexpected alliance offered new possibilities but also new risks.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You considered the legacy you would leave and how to effect lasting scientific impact.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "A technological advancement changed the dynamics of surveying, forcing you to adapt.",
        "attributes": { "INT": 2, "AGI": 1 }
      }
    ]
  }
  