{
    "early": [
      {
        "description": "Born into a family with a tradition of military or security service, you were trained in discipline and combat from a young age.",
        "attributes": { "STR": 2, "AGI": 1 }
      },
      {
        "description": "At age ten, you defended a sibling from aggressors, showcasing your protective instincts.",
        "attributes": { "STR": 2, "AGI": 1 }
      },
      {
        "description": "You enrolled in a youth academy focused on security training, excelling in physical and tactical exercises.",
        "attributes": { "STR": 2, "AGI": 1 }
      },
      {
        "description": "An encounter with local criminals taught you the importance of vigilance and readiness.",
        "attributes": { "STR": 2, "WIS": 1 }
      },
      {
        "description": "You developed a strict training regimen, enhancing your strength and agility beyond expectations.",
        "attributes": { "STR": 2, "AGI": 1 }
      },
      {
        "description": "Witnessing a security breach that led to harm, you vowed to prevent such incidents in the future.",
        "attributes": { "STR": 2, "WIS": 1 }
      },
      {
        "description": "You customized your equipment for better performance, demonstrating your initiative.",
        "attributes": { "STR": 2, "AGI": 1 }
      },
      {
        "description": "An experienced officer took you under their wing, teaching you advanced combat techniques.",
        "attributes": { "STR": 2, "INT": 1 }
      },
      {
        "description": "You formed a bond with fellow trainees, building strong camaraderie and teamwork skills.",
        "attributes": { "STR": 2, "AGI": 1 }
      },
      {
        "description": "A close call during a training exercise taught you to respect the dangers of your profession.",
        "attributes": { "STR": 2, "WIS": 1 }
      },
      {
        "description": "You began studying tactical manuals, increasing your understanding of security operations.",
        "attributes": { "INT": 2, "STR": 1 }
      },
      {
        "description": "An injury forced you to adapt and overcome physical limitations, strengthening your resolve.",
        "attributes": { "STR": 2, "AGI": 1 }
      },
      {
        "description": "You participated in a live-action simulation, handling the situation with composure.",
        "attributes": { "STR": 2, "AGI": 1 }
      },
      {
        "description": "A family member's involvement in illicit activities challenged your sense of duty.",
        "attributes": { "STR": 2, "WIS": 1 }
      },
      {
        "description": "You started practicing with advanced weaponry, enhancing your combat capabilities.",
        "attributes": { "STR": 2, "AGI": 1 }
      },
      {
        "description": "An encounter with a seasoned mercenary broadened your perspective on security work.",
        "attributes": { "INT": 2, "STR": 1 }
      },
      {
        "description": "You developed a reputation for being steadfast and reliable among your peers.",
        "attributes": { "STR": 2, "AGI": 1 }
      }
    ],
    "mid": [
      {
        "description": "You were assigned to a security detail protecting valuable corporate assets.",
        "attributes": { "STR": 1 }
      },
      {
        "description": "A confrontation with intruders tested your combat skills and resolve.",
        "attributes": { "STR": 1 }
      },
      {
        "description": "You successfully thwarted an attempted breach, earning commendation.",
        "attributes": { "AGI": 1 }
      },
      {
        "description": "An internal investigation required you to choose between loyalty and integrity.",
        "attributes": { "WIS": 1 }
      },
      {
        "description": "You began mentoring new recruits, sharing your knowledge and experience.",
        "attributes": { "STR": 1 }
      },
      {
        "description": "An error in judgment led to a security lapse, causing you to reassess your approach.",
        "attributes": { "WIS": 1 }
      },
      {
        "description": "You were involved in an operation that conflicted with your personal ethics.",
        "attributes": { "WIS": 1 }
      },
      {
        "description": "A personal relationship with a colleague complicated your duties.",
        "attributes": { "WIS": 1 }
      },
      {
        "description": "You faced ethical dilemmas when ordered to use excessive force.",
        "attributes": { "WIS": 1 }
      },
      {
        "description": "An unexpected promotion increased your responsibilities and challenges.",
        "attributes": { "STR": 1 }
      }
    ],
    "late": [
      {
        "description": "Promoted to head of security, you oversee the protection of critical assets.",
        "attributes": { "STR": 2, "INT": 1 }
      },
      {
        "description": "A significant threat tested your leadership and strategic planning.",
        "attributes": { "STR": 2, "WIS": 1 }
      },
      {
        "description": "You discovered corruption within the security force, challenging your loyalties.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "A personal loss affected your focus, prompting deep introspection.",
        "attributes": { "STR": 2, "WIS": 1 }
      },
      {
        "description": "You were offered a lucrative position that conflicted with your principles.",
        "attributes": { "STR": 2, "INT": 1 }
      },
      {
        "description": "An innovative security protocol you developed became standard practice.",
        "attributes": { "STR": 2, "INT": 1 }
      },
      {
        "description": "Faced with evidence of unethical orders, you considered defying them.",
        "attributes": { "STR": 2, "WIS": 1 }
      },
      {
        "description": "An internal power struggle required careful navigation of corporate politics.",
        "attributes": { "STR": 2, "INT": 1 }
      },
      {
        "description": "You began mentoring future leaders, shaping the next generation of security personnel.",
        "attributes": { "STR": 2, "AGI": 1 }
      },
      {
        "description": "A crisis required coordination with external agencies under intense pressure.",
        "attributes": { "STR": 2, "INT": 1 }
      },
      {
        "description": "You contemplated leaving to start your own security consultancy.",
        "attributes": { "STR": 2, "WIS": 1 }
      },
      {
        "description": "An opportunity arose to influence corporate policy on security measures.",
        "attributes": { "STR": 2, "INT": 1 }
      },
      {
        "description": "You faced backlash for questioning questionable orders from higher-ups.",
        "attributes": { "STR": 2, "WIS": 1 }
      },
      {
        "description": "An alliance with a powerful executive offered advancement but at ethical costs.",
        "attributes": { "STR": 2, "INT": 1 }
      },
      {
        "description": "You authored a manual on advanced security tactics, enhancing your reputation.",
        "attributes": { "STR": 2, "INT": 1 }
      },
      {
        "description": "A health issue prompted you to reconsider your career path and life's priorities.",
        "attributes": { "STR": 2, "WIS": 1 }
      },
      {
        "description": "You uncovered plans that endangered innocents, challenging your ethics.",
        "attributes": { "STR": 2, "WIS": 1 }
      }
    ]
  }
  