{
    "early": [
      {
        "description": "Born on a spacecraft, you grew up navigating tight corridors and complex machinery.",
        "attributes": { "AGI": 2, "INT": 1 }
      },
      {
        "description": "At age eight, you repaired a malfunctioning air filter, impressing the crew with your aptitude.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You began an apprenticeship under the ship's chief engineer, learning the basics of maintenance.",
        "attributes": { "AGI": 2, "STR": 1 }
      },
      {
        "description": "A power surge almost caused a catastrophic failure, teaching you the importance of vigilance.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You developed a knack for moving swiftly through the ship's ductwork to reach critical areas.",
        "attributes": { "AGI": 2, "STR": 1 }
      },
      {
        "description": "Witnessing a system malfunction that injured a crew member instilled in you a sense of responsibility.",
        "attributes": { "AGI": 2, "WIS": 1 }
      },
      {
        "description": "You customized your toolkit for efficiency, demonstrating your innovative spirit.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "An older technician taught you advanced diagnostics, enhancing your technical skills.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You formed a bond with another young crew member, exploring the ship and sharing dreams.",
        "attributes": { "AGI": 2, "STR": 1 }
      },
      {
        "description": "A sudden decompression required you to seal a breach quickly, showcasing your agility under pressure.",
        "attributes": { "AGI": 2, "STR": 1 }
      },
      {
        "description": "You began studying advanced engineering manuals, expanding your knowledge base.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "An error you made caused a minor system failure, teaching you humility and the value of double-checking work.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You discovered an inefficiency in the ship's engine output, leading to improvements.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "A mysterious signal intercepted during maintenance sparked your curiosity about the unknown.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You customized a maintenance drone to assist in repairs, increasing efficiency.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "An illness confined you to quarters, teaching you patience and the importance of self-care.",
        "attributes": { "STR": 2, "WIS": 1 }
      },
      {
        "description": "You began to question the corporation's policies after noticing discrepancies in supply allocations.",
        "attributes": { "INT": 2, "WIS": 1 }
      }
    ],
    "mid": [
      {
        "description": "You were promoted to junior technician, taking on more complex tasks.",
        "attributes": { "AGI": 1 }
      },
      {
        "description": "A critical system failure required you to perform emergency repairs in hazardous conditions.",
        "attributes": { "STR": 1 }
      },
      {
        "description": "You designed a software patch that improved system stability.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "An encounter with space debris damaged the ship, and you had to coordinate repairs quickly.",
        "attributes": { "AGI": 1 }
      },
      {
        "description": "You began mentoring a new technician, sharing your expertise.",
        "attributes": { "AGI": 1 }
      },
      {
        "description": "A malfunction you couldn't immediately fix caused self-doubt, affecting your performance.",
        "attributes": { "WIS": 1 }
      },
      {
        "description": "You discovered unauthorized modifications to ship systems, raising security concerns.",
        "attributes": { "INT": 1 }
      },
      {
        "description": "An opportunity to transfer to a state-of-the-art vessel arose, challenging your loyalties.",
        "attributes": { "WIS": 1 }
      },
      {
        "description": "You developed a rivalry with another technician, pushing both of you to excel.",
        "attributes": { "AGI": 1 }
      },
      {
        "description": "An EVA mission required you to repair external components, confronting your fear of open space.",
        "attributes": { "STR": 1 }
      }
    ],
    "late": [
      {
        "description": "Promoted to senior technician, you now oversee critical ship systems.",
        "attributes": { "AGI": 2, "INT": 1 }
      },
      {
        "description": "A catastrophic event required you to coordinate repairs to save the ship.",
        "attributes": { "AGI": 2, "WIS": 1 }
      },
      {
        "description": "You discovered a corporate cover-up involving faulty equipment.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "A mysterious illness spread among the crew, possibly linked to environmental controls you manage.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "You were offered a position on a pioneering deep-space mission, challenging your comfort zone.",
        "attributes": { "AGI": 2, "INT": 1 }
      },
      {
        "description": "An AI system you helped develop began exhibiting erratic behavior.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "Budget cuts forced you to make tough decisions about maintenance priorities, impacting safety.",
        "attributes": { "AGI": 2, "WIS": 1 }
      },
      {
        "description": "You began to suffer from fatigue due to prolonged shifts, questioning corporate policies.",
        "attributes": { "STR": 2, "INT": 1 }
      },
      {
        "description": "A faction within the crew sought your expertise to modify the ship for their own agenda.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "You mentored a prodigy who could potentially surpass you, prompting reflections on your legacy.",
        "attributes": { "AGI": 2, "STR": 1 }
      },
      {
        "description": "An incident led to you being falsely accused of sabotage, threatening your career.",
        "attributes": { "AGI": 2, "WIS": 1 }
      },
      {
        "description": "You discovered alien technology integrated into the ship without crew knowledge.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "A personal tragedy affected your focus, causing you to reconsider your path.",
        "attributes": { "STR": 2, "WIS": 1 }
      },
      {
        "description": "You authored a comprehensive guide on ship maintenance, solidifying your expertise.",
        "attributes": { "INT": 2, "AGI": 1 }
      },
      {
        "description": "An opportunity to retire or take shore leave presented itself, but you struggled with the decision.",
        "attributes": { "AGI": 2, "WIS": 1 }
      },
      {
        "description": "You faced a moral dilemma when ordered to prioritize a corporate mission over crew safety.",
        "attributes": { "INT": 2, "WIS": 1 }
      },
      {
        "description": "An external threat, such as pirates or a rival corporation, required you to use your skills defensively.",
        "attributes": { "AGI": 2, "INT": 1 }
      }
    ]
  }
  