{
    "early": [
      {
        "description": "Born on a ship harboring smugglers, your earliest memories are of secret compartments and whispered plans.",
        "attributes": { "AGI": 2, "STR": 2 }
      },
      {
        "description": "You learned to pick pockets in the bustling black markets, honing your dexterity and stealth.",
        "attributes": { "AGI": 2, "STR": 2 }
      },
      {
        "description": "Witnessing a deal gone wrong, you narrowly escaped a violent crackdown by corporate enforcers.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "A seasoned pirate took you under their wing, teaching you the basics of navigation and evasion.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "You stowed away on a freighter to avoid capture, surviving by your wits and agility.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "An injury during a botched theft left you with a scar and a lesson in caution.",
        "attributes": { "AGI": 2, "STR": 2 }
      },
      {
        "description": "You mastered the art of lockpicking, gaining access to places others couldn't reach.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "Growing up around rough characters, you learned to fight dirty to survive.",
        "attributes": { "STR": 2, "AGI": 2 }
      },
      {
        "description": "You discovered hidden passages within your colony, using them to move undetected.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "A close call with a xenomorph taught you the value of speed over strength.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "You helped smuggle contraband goods, learning the routes and methods to avoid detection.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "Betrayed by a friend over loot, you developed trust issues but also a keen sense for deceit.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "You found a malfunctioning drone and repurposed it for your own needs, displaying ingenuity.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "Escaping a corporate raid, you navigated through tight ventilation shafts to freedom.",
        "attributes": { "AGI": 2, "STR": 2 }
      },
      {
        "description": "You honed your skills in zero-gravity environments, becoming adept at spacewalks and EVA maneuvers.",
        "attributes": { "AGI": 2, "STR": 2 }
      },
      {
        "description": "An old spacer taught you the secrets of celestial navigation, sparking a love for the stars.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "You participated in street races, pushing the limits of speed and reflexes.",
        "attributes": { "AGI": 2, "STR": 2 }
      }
    ],
    "mid": [
      {
        "description": "You successfully led a small crew on a hijacking mission, showcasing leadership and daring.",
        "attributes": { "AGI": 2, "STR": 1, "WIS": 1 }
      },
      {
        "description": "Captured by corporate forces, you orchestrated a daring escape, solidifying your reputation.",
        "attributes": { "AGI": 2, "STR": 2 }
      },
      {
        "description": "You acquired a stolen ship, learning its ins and outs to stay one step ahead of pursuers.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "A heist went wrong, resulting in the loss of a crew member; you carry the weight of responsibility.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "You navigated through a hazardous asteroid field to evade capture, demonstrating exceptional piloting skills.",
        "attributes": { "AGI": 2, "STR": 2 }
      },
      {
        "description": "An encounter with a rival pirate crew led to a fierce battle; you emerged victorious but wounded.",
        "attributes": { "STR": 2, "AGI": 2 }
      },
      {
        "description": "You decoded encrypted corporate communications, gaining valuable intel for future raids.",
        "attributes": { "INT": 2, "AGI": 2 }
      },
      {
        "description": "Forming an uneasy alliance with a smuggler, you expanded your operations but faced new risks.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "You developed a network of contacts in the black market, enhancing your resources and influence.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "A close brush with a xenomorph infestation forced you to abandon a lucrative haul.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "You learned advanced combat techniques from a veteran pirate, increasing your effectiveness in raids.",
        "attributes": { "STR": 2, "AGI": 2 }
      },
      {
        "description": "A betrayal within your crew led to a mutiny; you had to fight to regain control.",
        "attributes": { "STR": 2, "AGI": 2 }
      },
      {
        "description": "You orchestrated a heist on a corporate vault, gaining wealth but attracting significant attention.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "An injury forced you to rely more on cunning and agility rather than brute strength.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "You discovered an old star chart leading to uncharted territories, sparking a desire for exploration.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "Facing a moral dilemma, you chose to save a civilian vessel instead of completing your mission.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "You developed a signature tactic or maneuver that became feared among your enemies.",
        "attributes": { "AGI": 2, "STR": 2 }
      }
    ],
    "late": [
      {
        "description": "You became the captain of your own ship, leading a crew of seasoned pirates.",
        "attributes": { "AGI": 2, "STR": 2 }
      },
      {
        "description": "An alliance with a notorious pirate lord offered greater power but at the cost of your autonomy.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "You infiltrated a high-security corporate facility to retrieve valuable data, pushing your skills to the limit.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "A tragic loss during a mission led you to question the pirate life, contemplating a different path.",
        "attributes": { "WIS": 2, "STR": 2 }
      },
      {
        "description": "You orchestrated a massive raid on a corporate convoy, striking a significant blow against them.",
        "attributes": { "AGI": 2, "STR": 2 }
      },
      {
        "description": "Facing betrayal from within, you rooted out spies and reasserted control over your crew.",
        "attributes": { "STR": 2, "AGI": 2 }
      },
      {
        "description": "You encountered an alien artifact that granted strange abilities or knowledge, altering your perspective.",
        "attributes": { "INT": 2, "AGI": 2 }
      },
      {
        "description": "A confrontation with a corporate nemesis became personal, fueling a desire for vengeance.",
        "attributes": { "STR": 2, "AGI": 2 }
      },
      {
        "description": "You negotiated a truce between rival pirate factions, showcasing leadership and diplomacy.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "An opportunity to go legitimate arose, challenging your identity and loyalties.",
        "attributes": { "WIS": 2, "STR": 2 }
      },
      {
        "description": "You led an assault on a xenomorph-infested derelict, seeking valuable salvage but risking everything.",
        "attributes": { "STR": 2, "AGI": 2 }
      },
      {
        "description": "A prophecy or vision hinted at a greater destiny, influencing your decisions and actions.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "You discovered a mole within your organization, forcing you to make hard choices about trust and justice.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "A close ally betrayed you, leading to a fierce rivalry that consumed much of your focus.",
        "attributes": { "STR": 2, "AGI": 2 }
      },
      {
        "description": "You found a map to a legendary treasure or lost technology, setting you on a perilous quest.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "Facing a no-win scenario, you made a sacrifice that saved your crew but cost you dearly.",
        "attributes": { "WIS": 2, "STR": 2 }
      },
      {
        "description": "You became a legend among pirates, with stories of your exploits spreading far and wide.",
        "attributes": { "AGI": 2, "STR": 2 }
      }
    ]
  }
  