{
    "early": [
      {
        "description": "You witnessed the unjust arrest of a family member by corrupt officials, igniting a deep-seated desire to fight oppression.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "As a child, you secretly delivered messages for resistance members, developing stealth and quick thinking.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "You found a hidden cache of contraband literature, opening your eyes to the regime's propaganda and fueling your thirst for truth.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "Bullied by peers loyal to the regime, you learned to evade confrontation and pick your battles wisely.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "A mentor taught you the art of lockpicking and infiltration, skills that became a secret hobby and potential future tools.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "You overheard plans for a crackdown on dissenters, instilling in you a cautious nature and a drive to warn others.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "An accident during a protest left you with a minor injury, a constant reminder of the cause and the risks involved.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "You developed a secret code language with friends to communicate safely, showcasing your creativity and intellect.",
        "attributes": { "INT": 2, "AGI": 2 }
      },
      {
        "description": "Witnessing the destruction of a beloved landmark by authorities, you felt a personal loss that steeled your resolve.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "You helped a stranger escape a dangerous situation, experiencing the thrill of defying authority.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "A close friend was coerced into informing on others, teaching you the painful complexities of loyalty and survival.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "You discovered an old, forbidden radio transmission that revealed truths about the outside world.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "Sneaking out after curfew became a routine, honing your stealth and giving you a sense of freedom.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "You crafted makeshift gadgets from scrap materials, showcasing ingenuity and a knack for improvisation.",
        "attributes": { "INT": 2, "AGI": 2 }
      },
      {
        "description": "Experiencing food shortages firsthand, you learned to scavenge and share resources, fostering community bonds.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "You witnessed a secret meeting between resistance leaders, igniting your curiosity and a desire to join their ranks.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "An encounter with a sympathetic official showed you that not all authority figures are enemies, adding nuance to your worldview.",
        "attributes": { "WIS": 2, "INT": 2 }
      }
    ],
    "mid": [
      {
        "description": "You successfully infiltrated a government facility to retrieve crucial information, marking your first major act of rebellion.",
        "attributes": { "AGI": 2, "INT": 1, "WIS": 1 }
      },
      {
        "description": "Betrayed by someone you trusted, you narrowly escaped capture, deepening your mistrust and sharpening your instincts.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "You led a small cell of operatives on sabotage missions, developing leadership skills and tactical thinking.",
        "attributes": { "INT": 2, "AGI": 1, "WIS": 1 }
      },
      {
        "description": "Captured during a mission, you endured interrogation without breaking, strengthening your mental fortitude.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "You orchestrated a successful propaganda campaign, spreading hope and rallying more to the cause.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "A mission went awry, resulting in the loss of a teammate; you grapple with guilt and a drive to honor their memory.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "You uncovered evidence of atrocities committed by the regime, fueling your determination to expose the truth.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "Developing a network of informants, you became a key intelligence gatherer for the resistance.",
        "attributes": { "INT": 2, "AGI": 2 }
      },
      {
        "description": "You mastered the art of disguise and deception, allowing you to move unnoticed in enemy territory.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "A close call with a detection drone enhanced your skills in electronic countermeasures.",
        "attributes": { "INT": 2, "AGI": 2 }
      },
      {
        "description": "You forged an uneasy alliance with a rival faction, balancing cooperation with underlying tension.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "An injury sustained during a mission left you with a lingering weakness, but also a reminder of your resilience.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "You intercepted communications that saved the resistance from an ambush, earning you respect and new responsibilities.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "Developing encryption algorithms, you secured the resistance's communications against increasing surveillance.",
        "attributes": { "INT": 2, "AGI": 2 }
      },
      {
        "description": "You witnessed a mass uprising that was brutally suppressed, reinforcing the high stakes of your struggle.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "Training under a seasoned operative, you honed your combat and survival skills, preparing for more dangerous missions.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "You orchestrated a heist to obtain medical supplies for the needy, blending altruism with tactical acumen.",
        "attributes": { "AGI": 2, "INT": 2 }
      }
    ],
    "late": [
      {
        "description": "You led a major operation that struck a significant blow against the regime, altering the balance of power.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "Facing a moral dilemma, you chose to save civilians over completing a mission, reflecting your values and priorities.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "An internal schism threatened the resistance; you worked to unify the factions, demonstrating leadership and diplomacy.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "You discovered a mole within the organization, navigating the delicate process of exposing them without causing panic.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "Capturing a high-ranking official, you extracted critical information but grappled with the ethical implications.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "A personal loss drove you to take greater risks, blurring the line between vengeance and duty.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "You negotiated aid from an external ally, expanding the resistance's resources but introducing new complexities.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "Facing burnout, you questioned your role in the fight, contemplating a new path while dealing with internal conflict.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "You devised a long-term strategy that could turn the tide but requires patience and meticulous planning.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "An opportunity to eliminate a major threat arose, but success would come at a high personal cost.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "You became a symbol of the resistance, with all the influence and scrutiny that entails, affecting your privacy and safety.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "A plan you set in motion led to unintended civilian casualties, causing you to reevaluate your methods.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "You infiltrated the highest levels of the regime, walking a tightrope between gathering intelligence and being discovered.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "A technological breakthrough gave the resistance an edge, but its use posed ethical questions you had to address.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "You were offered amnesty in exchange for abandoning the cause, forcing you to confront your commitment and goals.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "A final confrontation with a nemesis tested your skills and resolve, leaving a lasting impact on your future.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "With victory in sight, you planned for the post-conflict world, aiming to build a just society while others vied for power.",
        "attributes": { "INT": 2, "WIS": 2 }
      }
    ]
  }
  