{
    "early": [
      {
        "description": "Born into a society under strict corporate control, you witnessed the suppression of basic freedoms, igniting a questioning mind.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "At a young age, you found forbidden literature that opened your eyes to alternative ways of thinking.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "You saw a family member detained for speaking out, instilling in you a deep-seated desire for justice.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "Participating in underground discussions, you developed strong oratory skills and a passion for change.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "Bullied for questioning authority, you learned to navigate social dynamics carefully.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "You helped distribute anonymous pamphlets criticizing the corporation, taking your first steps into activism.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "Witnessing the harsh working conditions in factories, you vowed to fight for workers' rights.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "You formed a close bond with a mentor who taught you about the history of resistance movements.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "An encounter with corporate enforcers taught you the importance of discretion and awareness.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "You organized a small protest at your school, experiencing both the thrill of activism and the consequences.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "A close friend was taken away for dissent, deepening your resolve to oppose oppressive systems.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "You discovered you have a natural talent for inspiring others through speech or art.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "An accident caused by corporate negligence affected your community, fueling your anger towards the system.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "You learned basic survival skills from elders who remembered times before corporate rule.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "A secret meeting you attended was raided, teaching you the risks involved in dissent.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "You began keeping a journal of your thoughts and observations, honing your analytical skills.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "Your family moved frequently due to corporate reassignments, exposing you to various social injustices.",
        "attributes": { "WIS": 2, "INT": 2 }
      }
    ],
    "mid": [
      {
        "description": "You established a clandestine group aiming to spread awareness and challenge corporate propaganda.",
        "attributes": { "WIS": 2, "INT": 1, "AGI": 1 }
      },
      {
        "description": "A public demonstration you organized was met with force; you narrowly escaped detainment.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "You infiltrated a corporate facility to gather evidence of wrongdoing, showcasing bravery and resourcefulness.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "A close ally betrayed your group, leading to arrests; you learned to be cautious about trust.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "You devised a code to communicate securely with other revolutionaries.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "An internal conflict within your movement forced you to mediate between factions.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "You helped smuggle someone important out of the city, demonstrating commitment to the cause.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "Suffering from burnout, you questioned your path but ultimately reaffirmed your dedication.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "You discovered a hidden talent for hacking, using it to disrupt corporate communications.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "A public speech you gave inspired many but also drew the attention of authorities.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "You were captured and interrogated but resisted revealing information, strengthening your resolve.",
        "attributes": { "WIS": 2, "STR": 2 }
      },
      {
        "description": "An injury sustained during an escape left you with a lasting reminder of the risks involved.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "You developed a manifesto outlining your vision for a better society.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "A mentor's death impacted you deeply, prompting you to take on more responsibility.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "You organized a network of safe houses, enhancing your group's operational capabilities.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "You began training in self-defense to protect yourself and others.",
        "attributes": { "WIS": 2, "STR": 2 }
      },
      {
        "description": "An ethical dilemma arose when deciding whether to use aggressive tactics; your choice defined your leadership.",
        "attributes": { "WIS": 2, "INT": 2 }
      }
    ],
    "late": [
      {
        "description": "You became a prominent leader in the revolutionary movement, coordinating large-scale actions.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "An opportunity to negotiate with corporate officials arose; you had to balance ideals with pragmatism.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "A betrayal at high levels led to a significant setback; you had to rebuild trust and momentum.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "You discovered evidence of deeper corruption than imagined, influencing your strategies.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "Faced with the choice to escalate tactics, you contemplated the moral implications.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "A close associate was captured; you planned a risky rescue mission.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "You developed a new philosophy or ideology that began to spread among the populace.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "An attempt on your life revealed internal threats; you had to secure your organization.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "You started to question whether the ends justify the means, leading to internal conflict.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "A significant victory boosted morale but also increased scrutiny from the corporation.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "You were offered a position within the corporate structure to enact change from within.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "An illness or injury forced you to delegate responsibilities, testing your trust in others.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "You began writing a comprehensive account of the movement's history, aiming to inspire future generations.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "A schism within the movement challenged your leadership and required delicate handling.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "You faced a moral crisis when unintended consequences arose from your actions.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "An external group offered support, but accepting it could compromise your movement's integrity.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "You contemplated retirement or passing on leadership, considering the legacy you'd leave behind.",
        "attributes": { "WIS": 2, "INT": 2 }
      }
    ]
  }
  