{
    "early": [
      {
        "description": "Born from colonists in cryosleep, you awakened to a world in crisis due to environmental failure.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "At a young age, you had to adapt quickly to an unfamiliar and hostile environment.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "You developed a deep connection with the land, learning to read its signs and moods.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "An encounter with dangerous wildlife taught you the importance of caution and respect.",
        "attributes": { "WIS": 2, "STR": 2 }
      },
      {
        "description": "You learned to forage and hunt, ensuring survival in a resource-scarce world.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "Witnessing the struggles of your community instilled in you a sense of responsibility.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "You customized tools and shelters from limited resources, showing ingenuity.",
        "attributes": { "INT": 2, "AGI": 2 }
      },
      {
        "description": "An elder taught you survival techniques and the history of your people.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "You formed a bond with another survivor, sharing knowledge and support.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "A close call with environmental hazards sharpened your instincts and reflexes.",
        "attributes": { "AGI": 2, "STR": 2 }
      },
      {
        "description": "You began studying the colony's archives, seeking answers and solutions.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "An illness in your community tested your resilience and problem-solving skills.",
        "attributes": { "WIS": 2, "STR": 2 }
      },
      {
        "description": "You discovered a hidden cache of supplies, improving your community's situation.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "A family member's disappearance prompted you to become more self-reliant.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "You started experimenting with sustainable practices to improve living conditions.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "An encounter with corporate representatives sparked your distrust of outside influences.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "You developed agility through navigating challenging terrains.",
        "attributes": { "AGI": 2, "STR": 2 }
      }
    ],
    "mid": [
      {
        "description": "You took on significant responsibilities within the colony, managing essential tasks.",
        "attributes": { "WIS": 3 }
      },
      {
        "description": "A conflict with other settlers led to increased tension and the need for diplomacy.",
        "attributes": { "WIS": 3 }
      },
      {
        "description": "You devised a method to improve resource management, earning respect.",
        "attributes": { "INT": 3 }
      },
      {
        "description": "An offer to evacuate challenged your commitment to the colony.",
        "attributes": { "WIS": 3 }
      },
      {
        "description": "You began mentoring younger members, passing on survival and ethical values.",
        "attributes": { "WIS": 3 }
      },
      {
        "description": "A personal loss due to environmental hazards made you question your path.",
        "attributes": { "WIS": 3 }
      },
      {
        "description": "You discovered evidence of corporate neglect leading to your colony's situation.",
        "attributes": { "INT": 3 }
      },
      {
        "description": "A romantic relationship complicated your responsibilities.",
        "attributes": { "WIS": 3 }
      },
      {
        "description": "You faced ethical choices when resources became scarce.",
        "attributes": { "WIS": 3 }
      },
      {
        "description": "An injury forced you to rely more on wisdom than physical ability.",
        "attributes": { "WIS": 3 }
      }
    ],
    "late": [
      {
        "description": "Elevated to a leadership role, you coordinated efforts to sustain the colony.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "A major crisis threatened your community's survival, requiring decisive action.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "You uncovered a plan that could improve conditions, prompting difficult choices.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "Faced with a moral dilemma, you had to choose between tradition and change.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "An opportunity to reconnect with the larger galaxy challenged your priorities.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "You exposed external factors harming your colony, preventing further damage.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "A personal tragedy prompted deep reflection on your leadership.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "You began to suffer from the psychological effects of prolonged hardship.",
        "attributes": { "WIS": 2, "STR": 2 }
      },
      {
        "description": "A movement to abandon the colony gained momentum, and you had to decide your role.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "You mentored a young leader, hoping to pass on your knowledge and values.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "Conditions worsened, making survival increasingly challenging.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "You authored a manifesto on sustainable living and community resilience.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "An external threat, such as disease or environmental disaster, endangered the colony.",
        "attributes": { "AGI": 2, "STR": 2 }
      },
      {
        "description": "You faced a critical decision when offered a chance to integrate with another group.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "An unexpected alliance offered new possibilities but also new risks.",
        "attributes": { "WIS": 2, "AGI": 2 }
      },
      {
        "description": "You considered the legacy you would leave and how to effect lasting change.",
        "attributes": { "WIS": 2, "INT": 2 }
      },
      {
        "description": "A technological advancement provided hope for the colony's future.",
        "attributes": { "INT": 2, "WIS": 2 }
      }
    ]
  }
  