{
    "early": [
      {
        "description": "Born on a ship constantly evading corporate patrols, you learned to move silently and stay hidden from a young age.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "You helped your family smuggle contraband, learning the art of concealment and quick thinking.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "An encounter with corporate enforcers resulted in a narrow escape, instilling in you a perpetual sense of caution.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "You discovered a hidden compartment on your family's ship, sparking a fascination with mechanics and secret spaces.",
        "attributes": { "INT": 2, "AGI": 2 }
      },
      {
        "description": "A botched smuggling run led to the loss of a family member, leaving you with survivor's guilt and a desire for retribution.",
        "attributes": { "AGI": 2, "STR": 2 }
      },
      {
        "description": "You formed a bond with a fugitive secretly smuggled aboard, teaching you empathy and the complexities of resisting corporate oppression.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "Learning to navigate asteroid fields became second nature, enhancing your reflexes and spatial awareness.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "You mastered sleight-of-hand tricks, useful for both entertainment and deception.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "Witnessing a betrayal within your smuggling ring, you became adept at reading people and spotting lies.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "You picked up several languages from different ports, broadening your communication skills.",
        "attributes": { "INT": 2, "AGI": 2 }
      },
      {
        "description": "A close call with a stowaway corporate agent taught you the importance of thorough checks and quick reflexes.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "You developed a knack for forging documents, helping your family avoid detection.",
        "attributes": { "INT": 2, "AGI": 2 }
      },
      {
        "description": "An injury during an escape left you with a limp, but you adapted by enhancing your other abilities.",
        "attributes": { "INT": 2, "STR": 2 }
      },
      {
        "description": "You learned to hack basic security systems, opening doors both literal and metaphorical.",
        "attributes": { "INT": 2, "AGI": 2 }
      },
      {
        "description": "A mentor taught you the art of negotiation, emphasizing the value of words over weapons.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "You assisted in planning routes that avoided detection, sharpening your strategic thinking.",
        "attributes": { "INT": 2, "AGI": 2 }
      },
      {
        "description": "Living under constant threat, you developed a calm demeanor in high-pressure situations.",
        "attributes": { "AGI": 2, "WIS": 2 }
      }
    ],
    "mid": [
      {
        "description": "You orchestrated a complex smuggling operation, successfully moving high-value goods past tight security.",
        "attributes": { "AGI": 2, "INT": 1, "STR": 1 }
      },
      {
        "description": "Captured by corporate forces, you negotiated your release by offering valuable information.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "A betrayal led to a close call with death; you survived by relying on your agility and wit.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "You developed a network of contacts across multiple colonies, expanding your influence.",
        "attributes": { "INT": 2, "AGI": 2 }
      },
      {
        "description": "An encounter with a rival smuggling group resulted in a tense standoff; you diffused it without bloodshed.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "You smuggled refugees out of a dangerous zone, blending profit with a sense of justice.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "A risky deal earned you substantial resources but also painted a target on your back.",
        "attributes": { "AGI": 2, "STR": 2 }
      },
      {
        "description": "You cracked a corporate encryption, uncovering secrets that could destabilize entire systems.",
        "attributes": { "INT": 2, "AGI": 2 }
      },
      {
        "description": "An injury forced you to rely more on your intelligence and less on physical prowess.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "You fell in love with someone from a corporate background, creating internal conflict and new perspectives.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "A heist went wrong, resulting in the loss of a valuable asset; you vowed to recover it.",
        "attributes": { "AGI": 2, "STR": 2 }
      },
      {
        "description": "You discovered a talent for piloting, navigating treacherous routes with ease.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "A personal vendetta led you to sabotage a corporate operation, risking exposure.",
        "attributes": { "AGI": 2, "STR": 2 }
      },
      {
        "description": "You developed a new method for concealing goods, staying ahead of corporate detection technologies.",
        "attributes": { "INT": 2, "AGI": 2 }
      },
      {
        "description": "An unexpected corporate crackdown forced you to abandon a profitable venture.",
        "attributes": { "AGI": 2, "WIS": 2 }
      },
      {
        "description": "You trained in advanced combat techniques to protect yourself and your operations.",
        "attributes": { "STR": 2, "AGI": 2 }
      },
      {
        "description": "You faced a moral dilemma when asked to smuggle dangerous substances; your choice defined your ethical boundaries.",
        "attributes": { "INT": 2, "WIS": 2 }
      }
    ],
    "late": [
      {
        "description": "You became the head of a smuggling ring, managing complex operations across multiple systems.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "A massive corporate crackdown threatened your livelihood; you had to adapt or perish.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "You orchestrated a daring operation to steal from a high-security facility, cementing your legend.",
        "attributes": { "AGI": 2, "STR": 2 }
      },
      {
        "description": "An old rival resurfaced, leading to a dangerous game of cat and mouse.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "You discovered a corporate conspiracy that could destabilize the entire sector.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "Faced with the opportunity to go legitimate, you struggled with the decision to leave the smuggling life.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "A betrayal within your organization forced you to purge disloyal elements.",
        "attributes": { "AGI": 2, "STR": 2 }
      },
      {
        "description": "You negotiated a truce between smuggling factions, demonstrating leadership and diplomacy.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "An illness contracted during a mission left you weakened, but you refused to let it hinder you.",
        "attributes": { "INT": 2, "STR": 2 }
      },
      {
        "description": "You discovered a cache of sensitive corporate data with immense value, attracting unwanted attention.",
        "attributes": { "INT": 2, "AGI": 2 }
      },
      {
        "description": "A close associate was captured by corporate forces; you planned a risky rescue operation.",
        "attributes": { "AGI": 2, "STR": 2 }
      },
      {
        "description": "You faced a moral crossroads when offered a lucrative deal that conflicted with your principles.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "An opportunity to dismantle a corporate monopoly presented itself; you had to rally others to your cause.",
        "attributes": { "INT": 2, "STR": 2 }
      },
      {
        "description": "You began mentoring a younger smuggler, passing on your knowledge and legacy.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "A vision or premonition suggested a greater purpose, influencing your future actions.",
        "attributes": { "INT": 2, "WIS": 2 }
      },
      {
        "description": "You staged a fake death to escape increasing corporate scrutiny, starting anew elsewhere.",
        "attributes": { "AGI": 2, "INT": 2 }
      },
      {
        "description": "Infiltrating a corporate boardroom, you gathered information that could change the balance of power.",
        "attributes": { "INT": 2, "AGI": 2 }
      }
    ]
  }
  